testCases/fallingDrop/system/VOFSetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      VOFSetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultSpecies
(
);

Udefault (0 0 0);

shapes
(
    Drop
    {
        alphaName alpha1;
        
        shape    ellipsoid;
        
        ellipsoidCoeffs
        {
            center   (0 0.003 0.005);
            radius   (0 0.0005 0.0005);
        }
        
        delVapor 3e-4;
        U        (0 0 -1);
        
        liquidSpecies
        (
        );
        
        vaporSpecies
        (
        );
    }
    

);


// ************************************************************************* //
